Repository: Sokphirun99/kh-pos-lite
Catalog: apps/lib/l10n/app_*.arb
Languages: km

# appTitle
source: KH POS Lite
km: ខេអេច ភאָס លាយទ៍

# tabItems
source: Items
km: ទំនិញ

# tabCustomers
source: Customers
km: អតិថិជន

# tabInvoices
source: Invoices
km: វិក្កយបត្រ

# tabSettings
source: Settings
km: ការកំណត់

# itemsSearchHint
source: Item Name
km: ឈ្មោះទំនិញ

# itemsEmptyTitle
source: Item Not Found
km: រកមិនឃើញទំនិញ

# itemsEmptySubtitle
source: Item might be not in your list
km: ទំនិញអាចមិនមានក្នុងបញ្ជីរបស់អ្នក

# itemsCreateButton
source: Create New Item
km: បង្កើតទំនិញថ្មី

# itemsSkuOnlyFilter
source: Search SKU only
km: ស្វែងរកតាម SKU ប៉ុណ្ណោះ

# itemsAdjustStockTooltip
source: Adjust Stock
km: កែតម្រូវស្តុក

# itemsCreateTooltip
source: Create Item
km: បង្កើតទំនិញ

# itemsStockChip
source: Stock: {count}
km: ស្តុក: {count}

# itemsFormTitleCreate
source: Create Item
km: បង្កើតទំនិញ

# itemsFormTitleEdit
source: Edit Item
km: កែប្រែទំនិញ

# itemsFormSectionBasicInfo
source: Basic Info
km: ព័ត៍មានមូលដ្ឋាន

# itemsFormSectionNote
source: Note
km: កំណត់ចំណាំ

# itemsFormSectionImage
source: Image
km: រូបភាព

# itemsFieldName
source: Item Name
km: ឈ្មោះទំនិញ

# itemsFieldCode
source: Item Code
km: កូដទំនិញ

# itemsFieldUnitCost
source: Unit Cost (៛)
km: តម្លៃដើម (៛)

# itemsFieldPrice
source: Price (៛)
km: តម្លៃលក់ (៛)

# itemsFieldStock
source: Stock
km: ស្តុក

# itemsFieldNoteHint
source: Write your note
km: សរសេរកំណត់ចំណាំរបស់អ្នក

# itemsAddImage
source: Add Image
km: បន្ថែមរូបភាព

# itemsPriceValidation
source: Price must be greater than or equal to the unit cost
km: តម្លៃលក់ត្រូវតែធំជាងឬស្មើតម្លៃដើម

# itemsSkuExists
source: SKU already exists
km: SKU នេះមានរួចហើយ

# itemsSkuFormat
source: Use 3-32 characters: letters, digits, _ or -
km: ប្រើតួអក្សរ 3-32: អក្សរ លេខ _ ឬ -

# customersSearchHint
source: Name, Phone
km: ឈ្មោះ, ទូរស័ព្ទ

# customersEmptyTitle
source: Customer Not Found
km: រកមិនឃើញអតិថិជន

# customersEmptySubtitle
source: Customer might be not in your list
km: អតិថិជនអាចមិនមានក្នុងបញ្ជីរបស់អ្នក

# customersCreateButton
source: Create New Customer
km: បង្កើតអតិថិជនថ្មី

# customersCreateTooltip
source: Create Customer
km: បង្កើតអតិថិជន

# customersFormTitleCreate
source: Create Customer
km: បង្កើតអតិថិជន

# customersFormTitleEdit
source: Edit Customer
km: កែប្រែអតិថិជន

# customersSectionBasicInfo
source: Basic Info
km: ព័ត៍មានមូលដ្ឋាន

# customersSectionAddress
source: Address
km: អាសយដ្ឋាន

# customersSectionNote
source: Note
km: កំណត់ចំណាំ

# customersFieldFullName
source: Full Name
km: ឈ្មោះពេញ

# customersFieldPhone
source: Phone
km: ទូរស័ព្ទ

# customersFieldAltPhone
source: Alternative Phone
km: ទូរស័ព្ទបន្ថែម

# customersFieldVatTin
source: VAT TIN
km: លេខ VAT

# customersFieldAddressHint
source: Address
km: អាសយដ្ឋាន

# customersFieldNoteHint
source: Write your note
km: សរសេរកំណត់ចំណាំរបស់អ្នក

# customersPrivacyHint
source: We respect your customers' privacy and never share their details.
km: យើងគោរពភាពឯកជនរបស់អតិថិជន ហើយមិនចែករំលែកទិន្នន័យរបស់ពួកគេទេ។

# customersDeleted
source: Customer deleted
km: បានលុបអតិថិជន

# commonDone
source: Done
km: រួចរាល់

# formRequired
source: Required
km: ត្រូវការ

# formNonNegative
source: Must be zero or greater
km: ត្រូវតែធំជាងឬស្មើសូន្យ

# loginTitle
source: Sign in
km: ចូលប្រើ

# loginSignIn
source: Sign in
km: ចូលប្រើ

# loginSubtitle
source: Track sales, print receipts, and sync automatically.
km: តាមដានការលក់ បោះពុម្ពវិក្កយបត្រ និងសមកាលកម្មដោយស្វ័យប្រវត្តិ។

# loginFeatureOffline
source: Works offline and syncs when you're back online.
km: ធ្វើការបានទោះនៅក្រៅបណ្តាញ ហើយសមកាលកម្មនៅពេលតភ្ជាប់ឡើងវិញ។

# loginFeatureReceipts
source: Print beautiful receipts or share invoices instantly.
km: បោះពុម្ពវិក្កយបត្រមានសោភ័ណភាព ឬចែករំលែកវិក្កយបត្រតាមអ៊ីលេកត្រូនិកភ្លាមៗ។

# loginFeatureKhqr
source: Collect cashless payments with KHQR and Telegram alerts.
km: ទទួលការទូទាត់គ្មានសាច់ប្រាក់ជាមួយ KHQR និងការជូនដំណឹង Telegram។

# settingsLanguage
source: Language
km: ភាសា

# settingsLanguageKm
source: Khmer
km: ខ្មែរ

# settingsLanguageEn
source: English
km: អង់គ្លេស

# settingsDarkMode
source: Dark Mode
km: របៀបងងឹត

# settingsGeneralSection
source: Workspace
km: កន្លែងធ្វើការ

# settingsGeneralSectionSubtitle
source: Manage your profile and sync status.
km: គ្រប់គ្រងព័ត៌មានសម្គាល់ និងស្ថានភាពសមកាលកម្ម។

# settingsSyncNow
source: Sync now
km: សមកាលកម្មឥឡូវនេះ

# settingsSyncIdle
source: Sync idle
km: កំពុងសម្រាកសមកាលកម្ម

# settingsSyncing
source: Syncing...
km: កំពុងសមកាលកម្ម...

# settingsSyncError
source: Sync error: {message}
km: កំហុសសមកាលកម្ម: {message}

# settingsSyncDeleted
source: Deleted
km: បានលុប

source: UNDO
km: មិនធ្វើវិញ

source: No products
km: គ្មានផលិតផល

source: No sales
km: គ្មានការលក់

# salesEmptyDescription
source: Create a sale to start tracking payments.
km: បង្កើតការលក់ដើម្បីចាប់ផ្តើមតាមដានការទូទាត់។

source: No payments
km: គ្មានការទូទាត់

# paymentsTitle
source: Payments
km: ការទូទាត់

# paymentsSubtitle
source: Review collections across cash and transfer channels.
km: ពិនិត្យទឹកប្រាក់ដែលទទួលបានតាមសាច់ប្រាក់ និងផ្ទេរប្រាក់។

# paymentsSummaryCollected
source: Collected
km: ទឹកប្រាក់ដែលបានទទួល

# paymentsSummaryCount
source: Payments recorded
km: ការទូទាត់ដែលបានកត់ត្រា

# paymentsFilterAll
source: All
km: ទាំងអស់

# paymentsFilterCash
source: Cash
km: សាច់ប្រាក់

# paymentsFilterTransfer
source: Transfer
km: ផ្ទេរប្រាក់

# paymentsSearchHint
source: Search by sale, method, or reference
km: ស្វែងរកតាមការលក់ វិធីទូទាត់ ឬលេខយោង

# paymentsEmptyDescription
source: Add payments as you collect cash or receive transfers.
km: បន្ថែមការទូទាត់នៅពេលទទួលសាច់ប្រាក់ ឬទទួលការផ្ទេរប្រាក់។

# paymentsMethodLabel
source: Payment method
km: វិធីទូទាត់

# paymentsFormSaleId
source: Sale ID
km: លេខកូដការលក់

# paymentsFormSubmit
source: Save payment
km: រក្សាទុកការទូទាត់

# lastSyncAt
source: Last sync: {time}
km: សមកាលកម្មចុងក្រោយ: {time}

# settingsShowSyncBanner
source: Show sync banner
km: បង្ហាញបន្ទះសមកាលកម្ម

# settingsEnableBatchSync
source: Enable batch sync
km: អនុញ្ញាតសមកាលកម្មជាក្បាល

# settingsBatchSize
source: Batch size
km: ទំហំក្បាល

# settingsBatchSizeHint
source: Process {size} invoices per batch
km: ដំណើរការ {size} វិក័យប័ត្រក្នុងមួយក្បាល

# settingsPreferencesSection
source: Preferences
km: ចំណូលចិត្ត

# settingsPreferencesSectionSubtitle
source: Personalize how the app looks and feels.
km: ប្ដូររបៀបដែលកម្មវិធីមើលទៅ និងមានអារម្មណ៍។

# settingsSyncSection
source: Automation
km: សមកាលកម្មស្វ័យប្រវត្តិ

# settingsSyncSectionSubtitle
source: Fine tune batch sync and inventory safeguards.
km: លៃតម្រូវសមកាលកម្មជាក្បាល និងការពារស្តុក។

# aboutTitle
source: About
km: អំពីកម្មវិធី

# aboutDbVersion
source: DB version
km: កំណែនៃមូលដ្ឋានទិន្នន័យ

# aboutAppVersion
source: App version
km: កំណែនៃកម្មវិធី

# aboutLastSync
source: Last sync
km: សមកាលកម្មចុងក្រោយ

# aboutQaParams
source: QA params
km: ប៉ារ៉ាម៉ែត្រ QA

# aboutCopied
source: Copied
km: បានចម្លង

# aboutResetLocalDb
source: Reset local data
km: សម្អាតទិន្នន័យមូលដ្ឋាន

# aboutResetLocalDbHint
source: Long-press to reset
km: ចុចសង្កត់ដើម្បីសម្អាត

# aboutConfirmTitle
source: Confirm reset
km: បញ្ជាក់ទៅកាន់ការសម្អាត

# aboutConfirmMessage
source: This will delete local data. Continue?
km: នេះនឹងលុបទិន្នន័យក្នុងឧបករណ៍។ បន្តឬ?

source: Cancel
km: បោះបង់

source: OK
km: យល់ព្រម

source: Error
km: កំហុស

# checkoutTitle
source: Checkout
km: គិតលុយ

# checkoutTotal
source: Total
km: សរុប

# checkoutCash
source: Cash
km: សាច់ប្រាក់

# checkoutTransfer
source: Transfer
km: ផ្ទេរលុយ

# checkoutAmountReceived
source: Amount received (៛)
km: ប្រាក់បានទទួល (៛)

# checkoutChangeDue
source: Change due
km: ប្រាក់អាប់

# checkoutRemaining
source: Remaining
km: ប្រាក់នៅខ្វះ

# checkoutCompleteSale
source: Complete Sale
km: បញ្ចប់ការលក់

# saleCompletedChange
source: Sale completed. Change: {amount}
km: បានបញ្ចប់ការលក់។ ប្រាក់អាប់: {amount}

# saleCompletedRemaining
source: Sale recorded. Remaining: {amount}
km: បានកត់ត្រាការលក់។ ប្រាក់នៅខ្វះ: {amount}

# salesAppBarSubtitle
source: Monitor customer payments and balances
km: តាមដានការទូទាត់ និងសមតុល្យអតិថិជន

source: Receive Payment
km: ទទួលការទូទាត់

# salesSummaryTotal
source: Total sales
km: ទឹកប្រាក់លក់សរុប

# salesSummaryOutstanding
source: Outstanding balance
km: ទឹកប្រាក់នៅសល់

# salesSummaryCompleted
source: Paid in full
km: បានទូទាត់ពេញលេញ

# salesCardTotal
source: Sale total
km: តម្លៃការលក់

# salesStatusOutstanding
source: Outstanding
km: នៅខ្វះ

# salesViewDetails
source: View details
km: មើលលម្អិត

# salesDeleteTooltip
source: Delete sale
km: លុបការលក់

# salesNewSale
source: New sale
km: ការលក់ថ្មី

source: Balance
km: សមតុល្យ

# saleDetailsTitle
source: Sale Details
km: ព័ត៌មានលម្អិតអំពីការលក់

source: Sale not found
km: រកមិនឃើញការលក់

source: Paid
km: បានទូទាត់

# settingsKhqrTitle
source: Static KHQR
km: KHQR ថេរ

# settingsUploadKhqr
source: Upload KHQR PNG
km: ផ្ទុកឡើងរូបភាព KHQR

# settingsRemoveKhqr
source: Remove KHQR
km: លុប KHQR

# settingsKhqrNotSet
source: No KHQR uploaded
km: មិនទាន់មាន KHQR

# checkoutTxReference
source: Transfer reference (optional)
km: លេខយោងផ្ទេរ (ស្រេចចិត្ត)

# checkoutScanKhqr
source: Ask customer to scan this KHQR
km: អញ្ជើញអតិថិជនស្កេន KHQR នេះ

# txRefLabel
source: Ref: {ref}
km: លេខយោង: {ref}

# settingsLowStockThreshold
source: Low stock threshold
km: កម្រិតស្តុកទាប

# settingsLowStockThresholdDescription
source: Alert when stock falls below {threshold}
km: ជូនដំណឹងនៅពេលស្តុកទាបជាង {threshold}

# adjustStockTitle
source: Adjust Stock
km: កែតម្រូវស្តុក

# stockLabel
source: Stock
km: ស្តុក

source: Decrease
km: បន្ថយ

source: Increase
km: បន្ថែម

source: Set Stock
km: កំណត់ស្តុក

# lowStock
source: Low
km: ស្តុកតិច

source: Insufficient stock
km: ស្តុកមិនគ្រប់គ្រាន់

source: Out of stock
km: អស់ស្តុក

# notEnoughStockFor
source: Not enough stock for {name}. Available: {qty}
km: ស្តុកមិនគ្រប់សម្រាប់ {name}។ នៅសល់: {qty}

# settingsAllowOversell
source: Allow oversell (warn only)
km: អនុញ្ញាតលក់លើស (ព្រមានតែប៉ុណ្ណោះ)

# settingsReceiptSection
source: Receipt branding
km: ម៉ាកវិក្កយបត្រ

# settingsReceiptSectionSubtitle
source: Customize how your shop appears on printed receipts.
km: ប្ដូររូបរាងហាងលើវិក្កយបត្រ។

# settingsPaymentSection
source: Payment integrations
km: ការរួមបញ្ចូលការទូទាត់

# settingsPaymentSectionSubtitle
source: Share KHQR codes and connect Telegram bots.
km: ចែករំលែក KHQR និងភ្ជាប់បុត Telegram។

# settingsDangerZone
source: Danger zone
km: តំបន់គ្រោះថ្នាក់

# settingsDangerZoneSubtitle
source: Sign out of this device.
km: ចាកចេញពីឧបករណ៍នេះ។

source: Exceeds stock
km: លើសស្តុក

source: Receipt
km: វិក្កយបត្រ

source: Print
km: បោះពុម្ព

source: Share
km: ចែករំលែក

source: Pair Printer
km: ភ្ជាប់ម៉ាស៊ីនបោះពុម្ព

# printingStarted
source: Printing...
km: កំពុងបោះពុម្ព...

# printingDone
source: Printed
km: បានបោះពុម្ព

source: Printing failed
km: បោះពុម្ពបរាជ័យ

source: Share PDF
km: ចែករំលែក PDF

# printBluetooth
source: Print (58mm Bluetooth)
km: បោះពុម្ព (ម៉ាស៊ីន 58mm)

# sendTelegram
source: Send to Telegram
km: ផ្ញើទៅ Telegram

# telegramNotConfigured
source: Telegram is not configured
km: មិនទាន់កំណត់ Telegram

source: Discount
km: បញ្ចុះតម្លៃ

# voidSale
source: Void/Cancel sale
km: លុបបោះបង់

source: Offline
km: ក្រៅបណ្តាញ

source: All synced
km: បានសមកាលកម្ម

# errorGeneric
source: Something went wrong. Please try again.
km: មានបញ្ហា សូមព្យាយាមម្ដងទៀត

source: Scan devices
km: ស្កេនឧបករណ៍

source: Scanning...
km: កំពុងស្កេន...

source: No devices found
km: រកមិនឃើញឧបករណ៍

# tapToSelect
source: Tap to select device
km: ចុចដើម្បីជ្រើសរើស

source: Test Print
km: បោះពុម្ពសាកល្បង

source: Unpair
km: ផ្ដាច់ការភ្ជាប់
